GUdaoxi/LR_project1/Drivers/FM33LR0xx_FL_Driver/Inc/fm33lr0xx_fl_gptim.h
/**
  * @brief
  * @rmtoll   CCMR    CCS    FL_GPTIM_CC_GetChannelMode
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_1
  *           @arg @ref FL_GPTIM_CHANNEL_2
  *           @arg @ref FL_GPTIM_CHANNEL_3
  *           @arg @ref FL_GPTIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_MODE_OUTPUT
  *           @arg @ref FL_GPTIM_CHANNEL_MODE_INPUT_NORMAL
  *           @arg @ref FL_GPTIM_CHANNEL_MODE_INPUT_CROSSOVER
  *           @arg @ref FL_GPTIM_CHANNEL_MODE_INPUT_TRC
  */
__STATIC_INLINE uint32_t FL_GPTIM_CC_GetChannelMode(GPTIM_Type *TIMx, uint32_t channel)
{
    switch(channel)
    {
        case FL_GPTIM_CHANNEL_1:
            return (uint32_t)(READ_BIT(TIMx->CCMR1, (0x3U << 0U)) >> 0U);
        case FL_GPTIM_CHANNEL_2:
            return (uint32_t)(READ_BIT(TIMx->CCMR1, (0x3U << 8U)) >> 8U);
        case FL_GPTIM_CHANNEL_3:
            return (uint32_t)(READ_BIT(TIMx->CCMR2, (0x3U << 0U)) >> 0U);
        case FL_GPTIM_CHANNEL_4:
            return (uint32_t)(READ_BIT(TIMx->CCMR2, (0x3U << 8U)) >> 8U);
        default:
            return 0;
    }
}

/**
  * @brief
  * @rmtoll   CCER    CCOP    FL_GPTIM_OC_SetChannelPolarity
  * @param    TIMx TIM instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_OC_POLARITY_NORMAL
  *           @arg @ref FL_GPTIM_OC_POLARITY_INVERT
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_1
  *           @arg @ref FL_GPTIM_CHANNEL_2
  *           @arg @ref FL_GPTIM_CHANNEL_3
  *           @arg @ref FL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_OC_SetChannelPolarity(GPTIM_Type *TIMx, uint32_t polarity, uint32_t channel)
{
    switch(channel)
    {
        case FL_GPTIM_CHANNEL_1:
            MODIFY_REG(TIMx->CCER, (0x1U << 1U), (polarity));
            break;
        case FL_GPTIM_CHANNEL_2:
            MODIFY_REG(TIMx->CCER, (0x1U << 5U), (polarity << 4U));
            break;
        case FL_GPTIM_CHANNEL_3:
            MODIFY_REG(TIMx->CCER, (0x1U << 9U), (polarity << 8U));
            break;
        case FL_GPTIM_CHANNEL_4:
            MODIFY_REG(TIMx->CCER, (0x1U << 13U), (polarity << 12U));
            break;
    }
}

/**
  * @brief
  * @rmtoll   CCER    CCOP    FL_GPTIM_OC_GetChannelPolarity
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_1
  *           @arg @ref FL_GPTIM_CHANNEL_2
  *           @arg @ref FL_GPTIM_CHANNEL_3
  *           @arg @ref FL_GPTIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPTIM_OC_POLARITY_NORMAL
  *           @arg @ref FL_GPTIM_OC_POLARITY_INVERT
  */
__STATIC_INLINE uint32_t FL_GPTIM_OC_GetChannelPolarity(GPTIM_Type *TIMx, uint32_t channel)
{
    switch(channel)
    {
        case FL_GPTIM_CHANNEL_1:
            return (uint32_t)(READ_BIT(TIMx->CCER, (0x1U << 1U)) >> 0U);
        case FL_GPTIM_CHANNEL_2:
            return (uint32_t)(READ_BIT(TIMx->CCER, (0x1U << 5U)) >> 4U);
        case FL_GPTIM_CHANNEL_3:
            return (uint32_t)(READ_BIT(TIMx->CCER, (0x1U << 9U)) >> 8U);
        case FL_GPTIM_CHANNEL_4:
            return (uint32_t)(READ_BIT(TIMx->CCER, (0x1U << 13U)) >> 12U);
        default:
            return 0;
    }
}

/**
  * @brief
  * @rmtoll   CCER    CCIP    FL_GPTIM_IC_SetChannelPolarity
  * @param    TIMx TIM instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_IC_POLARITY_NORMAL
  *           @arg @ref FL_GPTIM_IC_POLARITY_INVERT
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_1
  *           @arg @ref FL_GPTIM_CHANNEL_2
  *           @arg @ref FL_GPTIM_CHANNEL_3
  *           @arg @ref FL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_IC_SetChannelPolarity(GPTIM_Type *TIMx, uint32_t polarity, uint32_t channel)
{
    switch(channel)
    {
        case FL_GPTIM_CHANNEL_1:
            MODIFY_REG(TIMx->CCER, (0x1U << 1U), (polarity));
            break;
        case FL_GPTIM_CHANNEL_2:
            MODIFY_REG(TIMx->CCER, (0x1U << 5U), (polarity << 4U));
            break;
        case FL_GPTIM_CHANNEL_3:
            MODIFY_REG(TIMx->CCER, (0x1U << 9U), (polarity << 8U));
            break;
        case FL_GPTIM_CHANNEL_4:
            MODIFY_REG(TIMx->CCER, (0x1U << 13U), (polarity << 12U));
            break;
    }
}

/**
  * @brief
  * @rmtoll   CCER    CCIP    FL_GPTIM_IC_GetChannelPolarity
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_1
  *           @arg @ref FL_GPTIM_CHANNEL_2
  *           @arg @ref FL_GPTIM_CHANNEL_3
  *           @arg @ref FL_GPTIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPTIM_IC_POLARITY_NORMAL
  *           @arg @ref FL_GPTIM_IC_POLARITY_INVERT
  */
__STATIC_INLINE uint32_t FL_GPTIM_IC_GetChannelPolarity(GPTIM_Type *TIMx, uint32_t channel)
{
    switch(channel)
    {
        case FL_GPTIM_CHANNEL_1:
            return (uint32_t)(READ_BIT(TIMx->CCER, (0x1U << 1U)) >> 0U);
        case FL_GPTIM_CHANNEL_2:
            return (uint32_t)(READ_BIT(TIMx->CCER, (0x1U << 5U)) >> 4U);
        case FL_GPTIM_CHANNEL_3:
            return (uint32_t)(READ_BIT(TIMx->CCER, (0x1U << 9U)) >> 8U);
        case FL_GPTIM_CHANNEL_4:
            return (uint32_t)(READ_BIT(TIMx->CCER, (0x1U << 13U)) >> 12U);
        default:
            return 0;
    }
}

/**
  * @brief
  * @rmtoll   CCER    CCNP    FL_GPTIM_OCN_SetChannelPolarity
  * @param    TIMx TIM instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_OCN_POLARITY_NORMAL
  *           @arg @ref FL_GPTIM_OCN_POLARITY_INVERT
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_1
  *           @arg @ref FL_GPTIM_CHANNEL_2
  *           @arg @ref FL_GPTIM_CHANNEL_3
  *           @arg @ref FL_GPTIM_CHANNEL_4
  * @retval   None
  */

__STATIC_INLINE void FL_GPTIM_OCN_SetChannelPolarity(GPTIM_Type *TIMx, uint32_t polarity, uint32_t channel)
{
    MODIFY_REG(TIMx->CCER, (GPTIM_CCER_CCNP_Msk << (channel * 4)), (polarity << (channel * 4)));
}


/**
  * @brief
  * @rmtoll   CCER    CCE    FL_GPTIM_OC_EnableChannel
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_1
  *           @arg @ref FL_GPTIM_CHANNEL_2
  *           @arg @ref FL_GPTIM_CHANNEL_3
  *           @arg @ref FL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_OC_EnableChannel(GPTIM_Type *TIMx, uint32_t channel)
{
    switch(channel)
    {
        case FL_GPTIM_CHANNEL_1:
            SET_BIT(TIMx->CCER, (0x1U << 0U));
            break;
        case FL_GPTIM_CHANNEL_2:
            SET_BIT(TIMx->CCER, (0x1U << 4U));
            break;
        case FL_GPTIM_CHANNEL_3:
            SET_BIT(TIMx->CCER, (0x1U << 8U));
            break;
        case FL_GPTIM_CHANNEL_4:
            SET_BIT(TIMx->CCER, (0x1U << 12U));
            break;
    }
}

/**
  * @brief
  * @rmtoll   CCER    CCE    FL_GPTIM_OC_IsEnabledChannel
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_1
  *           @arg @ref FL_GPTIM_CHANNEL_2
  *           @arg @ref FL_GPTIM_CHANNEL_3
  *           @arg @ref FL_GPTIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_GPTIM_OC_IsEnabledChannel(GPTIM_Type *TIMx, uint32_t channel)
{
    switch(channel)
    {
        case FL_GPTIM_CHANNEL_1:
            return (uint32_t)(READ_BIT(TIMx->CCER, (0x1U << 0U)) >> 0U);
        case FL_GPTIM_CHANNEL_2:
            return (uint32_t)(READ_BIT(TIMx->CCER, (0x1U << 4U)) >> 4U);
        case FL_GPTIM_CHANNEL_3:
            return (uint32_t)(READ_BIT(TIMx->CCER, (0x1U << 8U)) >> 8U);
        case FL_GPTIM_CHANNEL_4:
            return (uint32_t)(READ_BIT(TIMx->CCER, (0x1U << 12U)) >> 12U);
        default:
            return 0;
    }
}

/**
  * @brief
  * @rmtoll   CCER    CCE    FL_GPTIM_OC_DisableChannel
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_1
  *           @arg @ref FL_GPTIM_CHANNEL_2
  *           @arg @ref FL_GPTIM_CHANNEL_3
  *           @arg @ref FL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_OC_DisableChannel(GPTIM_Type *TIMx, uint32_t channel)
{
    switch(channel)
    {
        case FL_GPTIM_CHANNEL_1:
            CLEAR_BIT(TIMx->CCER, (0x1U << 0U));
            break;
        case FL_GPTIM_CHANNEL_2:
            CLEAR_BIT(TIMx->CCER, (0x1U << 4U));
            break;
        case FL_GPTIM_CHANNEL_3:
            CLEAR_BIT(TIMx->CCER, (0x1U << 8U));
            break;
        case FL_GPTIM_CHANNEL_4:
            CLEAR_BIT(TIMx->CCER, (0x1U << 12U));
            break;
    }
}

/**
  * @brief
  * @rmtoll   CCER    CCE    FL_GPTIM_IC_EnableChannel
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_1
  *           @arg @ref FL_GPTIM_CHANNEL_2
  *           @arg @ref FL_GPTIM_CHANNEL_3
  *           @arg @ref FL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_IC_EnableChannel(GPTIM_Type *TIMx, uint32_t channel)
{
	
    switch(channel)
    {
        case FL_GPTIM_CHANNEL_1:
            SET_BIT(TIMx->CCER, (0x1U << 0U));
            break;
        case FL_GPTIM_CHANNEL_2:
            SET_BIT(TIMx->CCER, (0x1U << 4U));
            break;
        case FL_GPTIM_CHANNEL_3:
            SET_BIT(TIMx->CCER, (0x1U << 8U));
            break;
        case FL_GPTIM_CHANNEL_4:
            SET_BIT(TIMx->CCER, (0x1U << 12U));
            break;
    }
}

/**
  * @brief
  * @rmtoll   CCER    CCE    FL_GPTIM_IC_IsEnabledChannel
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_1
  *           @arg @ref FL_GPTIM_CHANNEL_2
  *           @arg @ref FL_GPTIM_CHANNEL_3
  *           @arg @ref FL_GPTIM_CHANNEL_4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_GPTIM_IC_IsEnabledChannel(GPTIM_Type *TIMx, uint32_t channel)
{
    switch(channel)
    {
        case FL_GPTIM_CHANNEL_1:
            return (uint32_t)(READ_BIT(TIMx->CCER, (0x1U << 0U)) >> 0U);
        case FL_GPTIM_CHANNEL_2:
            return (uint32_t)(READ_BIT(TIMx->CCER, (0x1U << 4U)) >> 4U);
        case FL_GPTIM_CHANNEL_3:
            return (uint32_t)(READ_BIT(TIMx->CCER, (0x1U << 8U)) >> 8U);
        case FL_GPTIM_CHANNEL_4:
            return (uint32_t)(READ_BIT(TIMx->CCER, (0x1U << 12U)) >> 12U);
        default:
            return 0;
    }
}

/**
  * @brief
  * @rmtoll   CCER    CCE    FL_GPTIM_IC_DisableChannel
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_1
  *           @arg @ref FL_GPTIM_CHANNEL_2
  *           @arg @ref FL_GPTIM_CHANNEL_3
  *           @arg @ref FL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_IC_DisableChannel(GPTIM_Type *TIMx, uint32_t channel)
{
    switch(channel)
    {
        case FL_GPTIM_CHANNEL_1:
            CLEAR_BIT(TIMx->CCER, (0x1U << 0U));
            break;
        case FL_GPTIM_CHANNEL_2:
            CLEAR_BIT(TIMx->CCER, (0x1U << 4U));
            break;
        case FL_GPTIM_CHANNEL_3:
            CLEAR_BIT(TIMx->CCER, (0x1U << 8U));
            break;
        case FL_GPTIM_CHANNEL_4:
            CLEAR_BIT(TIMx->CCER, (0x1U << 12U));
            break;
    }
}



/**
  * @brief    
  * @rmtoll   ECR    IPOS    FL_GPTIM_SetIndexPositioning
  * @param    TIMx TIM instance
  * @param    mode This parameter can be one of the following values:
              @arg @ref FL_GPTIM_INDEX_POSITION_DOWN_DOWN
						  @arg @ref FL_GPTIM_INDEX_POSITION_DOWN_UP
						  @arg @ref FL_GPTIM_INDEX_POSITION_UP_DOWN
							@arg @ref FL_GPTIM_INDEX_POSITION_UP_UP
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_SetIndexPositioning(GPTIM_Type* TIMx, uint32_t mode)
{
    MODIFY_REG(TIMx->ECR, GPTIM_ECR_IPOS_Msk, mode);
}

/**
  * @brief    
  * @note     
  * @rmtoll   ECR    FIDX    FL_GPTIM_SetIDXMode
  * @param    TIMx TIM instance
  * @param    IDXmode This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_INDEX_FIRST_ONLY
  *           @arg @ref FL_GPTIM_INDEX_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_SetIDXMode(GPTIM_Type* TIMx, uint32_t IDXmode)
{
    MODIFY_REG(TIMx->ECR, GPTIM_ECR_FIDX_Msk, IDXmode);
}

/**
  * @brief    
  * @note    
  * @rmtoll   ECR    FIDX    FL_GPTIM_GetIDXMode
  * @param    TIMx TIM instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPTIM_INDEX_FIRST_ONLY
  *           @arg @ref FL_GPTIM_INDEX_ALL
  */
__STATIC_INLINE uint32_t FL_GPTIM_GetIDXMode(GPTIM_Type* TIMx)
{
    return (uint32_t)(READ_BIT(TIMx->ECR, GPTIM_ECR_FIDX_Msk));
}

/**
  * @brief    
  * @rmtoll   ECR    IDIR    FL_GPTIM_SetIndex_Dir
  * @param    TIMx TIM instance
  * @param    polarity This parameter can be one of the following values:
							@arg @ref FL_GPTIM_INDEX_UP_DOWN
							@arg @ref FL_GPTIM_INDEX_UP
							@arg @ref FL_GPTIM_INDEX_DOWN

  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_SetIndex_Dir(GPTIM_Type* TIMx, uint32_t polarity)
{
    MODIFY_REG(TIMx->ECR, GPTIM_ECR_IDIR_Msk, polarity);
}

/**
  * @brief    
  * @rmtoll   ECR    INDEX_EN    FL_GPTIM_DisableIndex
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_DisableIndex(GPTIM_Type* TIMx)
{
    CLEAR_BIT(TIMx->ECR, GPTIM_ECR_IE_Msk);
}

/**
  * @brief    
  * @rmtoll   ECR    INDEX_EN    FL_GPTIM_EnableIndex
  * @param    TIMx TIM instance
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_EnableIndex(GPTIM_Type* TIMx)
{
    SET_BIT(TIMx->ECR, GPTIM_ECR_IE_Msk);
}

/**
  * @brief
  * @rmtoll   TISEL    TI1SEL    FL_GPTIM_SetChannelInput
  * @param    TIMx TIM instance
  * @param    filter This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_TISEL_Channel
  *           @arg @ref FL_GPTIM_TISEL_IN1
  *           @arg @ref FL_GPTIM_TISEL_IN2
  *           @arg @ref FL_GPTIM_TISEL_IN3
  *           @arg @ref FL_GPTIM_TISEL_IN4
  *           @arg @ref FL_GPTIM_TISEL_IN5
  *           @arg @ref FL_GPTIM_TISEL_IN6
  *           @arg @ref FL_GPTIM_TISEL_IN7
  *           @arg @ref FL_GPTIM_TISEL_IN8
  *           @arg @ref FL_GPTIM_TISEL_IN9
  *           @arg @ref FL_GPTIM_TISEL_IN10
  *           @arg @ref FL_GPTIM_TISEL_IN11
  *           @arg @ref FL_GPTIM_TISEL_IN12
  *           @arg @ref FL_GPTIM_TISEL_IN13
  *           @arg @ref FL_GPTIM_TISEL_IN14
  *           @arg @ref FL_GPTIM_TISEL_IN15
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_1
  *           @arg @ref FL_GPTIM_CHANNEL_2
  *           @arg @ref FL_GPTIM_CHANNEL_3
  *           @arg @ref FL_GPTIM_CHANNEL_4
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_SetChannelInput(GPTIM_Type *TIMx, uint32_t Input, uint32_t channel)
{
    switch(channel)
    {
        case FL_GPTIM_CHANNEL_1:
            MODIFY_REG(TIMx->TISEL, (0xFU << 0U), (Input));
            break;
        case FL_GPTIM_CHANNEL_2:
            MODIFY_REG(TIMx->TISEL, (0xFU << 8U), (Input << 8U));
            break;
        case FL_GPTIM_CHANNEL_3:
            MODIFY_REG(TIMx->TISEL, (0xFU << 16U), (Input<<16U));
            break;
        case FL_GPTIM_CHANNEL_4:
            MODIFY_REG(TIMx->TISEL, (0xFU << 24U), (Input << 24U));
            break;
    }
}


/**
  * @brief
  * @rmtoll   TISEL    TI1SEL    FL_GPTIM_IC_GetChannelInput
  * @param    TIMx TIM instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_CHANNEL_1
  *           @arg @ref FL_GPTIM_CHANNEL_2
  *           @arg @ref FL_GPTIM_CHANNEL_3
  *           @arg @ref FL_GPTIM_CHANNEL_4
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPTIM_TISEL_Channel
  *           @arg @ref FL_GPTIM_TISEL_IN1
  *           @arg @ref FL_GPTIM_TISEL_IN2
  *           @arg @ref FL_GPTIM_TISEL_IN3
  *           @arg @ref FL_GPTIM_TISEL_IN4
  *           @arg @ref FL_GPTIM_TISEL_IN5
  *           @arg @ref FL_GPTIM_TISEL_IN6
  *           @arg @ref FL_GPTIM_TISEL_IN7
  *           @arg @ref FL_GPTIM_TISEL_IN8
  *           @arg @ref FL_GPTIM_TISEL_IN9
  *           @arg @ref FL_GPTIM_TISEL_IN10
  *           @arg @ref FL_GPTIM_TISEL_IN11
  *           @arg @ref FL_GPTIM_TISEL_IN12
  *           @arg @ref FL_GPTIM_TISEL_IN13
  *           @arg @ref FL_GPTIM_TISEL_IN14
  *           @arg @ref FL_GPTIM_TISEL_IN15
  */
__STATIC_INLINE uint32_t FL_GPTIM_GetChannelInput(GPTIM_Type *TIMx, uint32_t channel)
{
    switch(channel)
    {
        case FL_GPTIM_CHANNEL_1:
            return (uint32_t)(READ_BIT(TIMx->TISEL, (0xFU << 0U)) >> 0U);
        case FL_GPTIM_CHANNEL_2:
            return (uint32_t)(READ_BIT(TIMx->TISEL, (0xFU << 8U)) >> 8U);
        case FL_GPTIM_CHANNEL_3:
            return (uint32_t)(READ_BIT(TIMx->TISEL, (0xFU << 16U)) >> 16U);
        case FL_GPTIM_CHANNEL_4:
            return (uint32_t)(READ_BIT(TIMx->TISEL, (0xFU << 24U)) >> 24U);
        default:
            return 0;
    }
}

/**
  * @brief    
  * @rmtoll   AFR    ETRSEL    FL_GPTIM_SetETR_Input_Source
  * @param    TIMx TIM instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_GPTIM_ETR_Input_time_etr_in0
  *           @arg @ref FL_GPTIM_ETR_Input_time_etr_in1
  *           @arg @ref FL_GPTIM_ETR_Input_time_etr_in2
  *           @arg @ref FL_GPTIM_ETR_Input_time_etr_in3
  *           @arg @ref FL_GPTIM_ETR_Input_time_etr_in4
  *           @arg @ref FL_GPTIM_ETR_Input_time_etr_in5
  *           @arg @ref FL_GPTIM_ETR_Input_time_etr_in6
  *           @arg @ref FL_GPTIM_ETR_Input_time_etr_in7
  *           @arg @ref FL_GPTIM_ETR_Input_time_etr_in8
  *           @arg @ref FL_GPTIM_ETR_Input_time_etr_in9
  *           @arg @ref FL_GPTIM_ETR_Input_time_etr_in10
  *           @arg @ref FL_GPTIM_ETR_Input_time_etr_in11
  *           @arg @ref FL_GPTIM_ETR_Input_time_etr_in12
  *           @arg @ref FL_GPTIM_ETR_Input_time_etr_in13
  *           @arg @ref FL_GPTIM_ETR_Input_time_etr_in14
  *           @arg @ref FL_GPTIM_ETR_Input_time_etr_in15
  * @retval   None
  */
__STATIC_INLINE void FL_GPTIM_SetETR_Input_Source(GPTIM_Type* TIMx, uint32_t source)
{
    MODIFY_REG(TIMx->AFR, GPTIM_AFR_ETRSEL_Msk, source);
}

/**
  * @brief    
  * @rmtoll       OCC1R_SEL    FL_SetOCREF_CLR_Source
  * @param    TIMx TIM instance
  * @param    mode This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_SetOCREF_CLR_Source(GPTIM_Type* TIMx, uint32_t mode)
{
    MODIFY_REG(TIMx->AFR, GPTIM_AFR_OCCRSEL_Msk, mode);
}

/**
  * @}
  */

/** @defgroup GPTIM_FL_EF_Init Initialization and de-initialization functions
  * @{
  */


/**
  * @}
  */

FL_ErrorStatus FL_GPTIM_IC_Init(GPTIM_Type *TIMx, uint32_t channel, FL_GPTIM_IC_InitTypeDef *ic_init);
FL_ErrorStatus FL_GPTIM_SlaveMode_Init(GPTIM_Type *TIMx, FL_GPTIM_SlaveInitTypeDef *slave_init);
FL_ErrorStatus FL_GPTIM_DeInit(GPTIM_Type *TIMx);
FL_ErrorStatus FL_GPTIM_Init(GPTIM_Type *TIMx, FL_GPTIM_InitTypeDef *init);
FL_ErrorStatus FL_GPTIM_OC_Init(GPTIM_Type *TIMx, uint32_t channel, FL_GPTIM_OC_InitTypeDef *ic_init); 
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LR0XX_FL_GPTIM_H*/


/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
